Documents/ESB/ESB_Consumer_0903/003TestSample/SAMPLE_XML_MUST/DepositAccount/DA27_AcctInfoChngInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DepositAccount/AcctInfoChngInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DepositAccount</ServiceDomain>  
      <OperationName>AcctInfoChngInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:AcctInfoChngInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DA27</v11:TxnId>  
        <v11:TxnNo>DA2700001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:PageInfo> 
          <v11:PageSize>50</v11:PageSize>  
          <v11:PageStart>1</v11:PageStart>  
          <!--Optional:-->  
          <v11:PageToken>201904170622107608.01,99</v11:PageToken> 
        </v11:PageInfo>  
        <v11:AcctNo>STR</v11:AcctNo>  
        <v11:StartDateEndDate>STR</v11:StartDateEndDate> 
      </v11:ServiceBody> 
    </v11:AcctInfoChngInqRq> 
  </soap:Body> 
</soap:Envelope>
